#ifndef BW1_DECOMP_MULTI_MAP_FIXED_INCLUDED_H
#define BW1_DECOMP_MULTI_MAP_FIXED_INCLUDED_H

#include <assert.h> /* For static_assert */
#include <stdbool.h> /* For bool */
#include <stddef.h> /* For size_t */
#include <stdint.h> /* For uint32_t, uint8_t */

#include <chlasm/Enum.h> /* For enum ABODE_TYPE, enum RESOURCE_TYPE */
#include <lionhead/lhlib/ver5.0/LHLinkedList.h> /* For DECLARE_LH_LINKED_LIST */
#include <reversing_utils/re_common.h> /* For bool32_t */
#include <reversing_utils/re_rtti.h> /* For struct RTTIBaseClassArray, struct RTTIBaseClassDescriptor, struct RTTIClassHierarchyDescriptor, struct RTTICompleteObjectLocator, struct RTTITypeDescriptor */

#include "Fixed.h" /* For struct Fixed, struct FixedVftable */
#include "GameThingWithPos.h" /* For struct GameThingWithPos */
#include "MapCoords.h" /* For struct JustMapXZ */
#include "Object.h" /* For struct Object */

// Forward Declares

struct Base;
struct BuildingSite;
struct Creature;
struct GFootpath;
struct GFootpathLink;
struct GInterfaceStatus;
struct GMultiMapFixedInfo;
struct GPlayer;
struct GameOSFile;
struct GameThing;
struct GameThingVftable;
struct GameThingWithPosVftable;
struct LH3DMesh;
struct LHOSFile;
struct Living;
struct MapCell;
struct MapCoords;
struct MultiMapFixed;
struct NewCollide;
struct ObjectVftable;
struct PlannedMultiMapFixed;
struct PotStructure;
struct Town;
struct Villager;

struct MultiChild
{
  struct Object* object;  /* 0x0 */
  struct JustMapXZ coords;
};
static_assert(sizeof(struct MultiChild) == 0x8, "Data type is of wrong size");

// Constructors

// win1.41 inlined mac 100dc120 MultiChild::MultiChild(void)
struct MultiChild* __fastcall __ct__10MultiChildFv(struct MultiChild* this) asm("??0MultiChild@@QAE@XZ");

struct MultiChildList
{
  struct MultiChild* array;  /* 0x0 */
  uint32_t size;
  uint32_t capacity;
};
static_assert(sizeof(struct MultiChildList) == 0xc, "Data type is of wrong size");

struct MultiMapFixedVftable
{
  struct FixedVftable super;  /* 0x0 */
  struct MapCoords* (__fastcall* GetDoorPos)(struct MultiMapFixed* this, const void* edx, struct MapCoords* pos);  /* 0x864 */
  float (__fastcall* GetInfluence)(struct MultiMapFixed* this);
  bool (__fastcall* IsPlaytimeStructure)(struct MultiMapFixed* this);
  bool (__fastcall* IsPlaytimeStarted)(struct MultiMapFixed* this);  /* 0x870 */
  bool (__fastcall* AddPlaytimeVillager)(struct MultiMapFixed* this, const void* edx, struct Villager* villager);
  void (__fastcall* CheckMapObject)(struct MultiMapFixed* this);
  void (__fastcall* GetResourceDropPosForComputerPlayer)(struct MultiMapFixed* this, const void* edx, struct MapCoords* drop_pos);
  float (__fastcall* GetPercentBuilt)(struct MultiMapFixed* this);  /* 0x880 */
  float (__fastcall* GetPercentRepaired)(struct MultiMapFixed* this);
  float (__fastcall* GetPercentRepairedFromWhenDamaged)(struct MultiMapFixed* this);
  bool (__fastcall* IsRepaired)(struct MultiMapFixed* this);
  bool (__fastcall* IsBuilt)(struct MultiMapFixed* this);  /* 0x890 */
  float (__fastcall* GetPercentRepairedForNonFunctional)(struct MultiMapFixed* this);
  float (__fastcall* GetPercentForDrawBuilding)(struct MultiMapFixed* this);
  float (__fastcall* GetPercentAbodeFullWithAdults)(struct MultiMapFixed* this);
  float (__fastcall* GetPercentAbodeFullWithChildren)(struct MultiMapFixed* this);  /* 0x8a0 */
  bool (__fastcall* IsDrawBuilding)(struct MultiMapFixed* this);
  bool (__fastcall* Built)(struct MultiMapFixed* this);
  bool (__fastcall* Repaired)(struct MultiMapFixed* this);
  uint32_t (__fastcall* GetBuildingSiteWood)(struct MultiMapFixed* this, const void* edx, uint32_t* param_1);  /* 0x8b0 */
  struct LH3DMesh* (__fastcall* GetDestructionMesh)(struct MultiMapFixed* this);
  void (__fastcall* RemoveDamage)(struct MultiMapFixed* this);
  void* (__fastcall* GetBuildingObject)(struct MultiMapFixed* this);
  bool (__fastcall* IsCivic)(struct MultiMapFixed* this);  /* 0x8c0 */
  enum ABODE_TYPE (__fastcall* GetAbodeType)(struct MultiMapFixed* this);
  void (__fastcall* SetPower)(struct MultiMapFixed* this, const void* edx, float power);
  struct MapCoords* (__fastcall* GetResourcePos)(struct MultiMapFixed* this, const void* edx, enum RESOURCE_TYPE type, int param_2);
  bool (__fastcall* IsPoisonedResource)(struct MultiMapFixed* this);  /* 0x8d0 */
  struct MapCoords* (__fastcall* GetResourceNearestEdge)(struct MultiMapFixed* this, const void* edx, struct MapCoords* coords, enum RESOURCE_TYPE type, struct Object* param_3, int param_4);
  float (__fastcall* GetDesireToBeRepaired)(struct MultiMapFixed* this);
  void (__fastcall* AddToPlayer)(struct MultiMapFixed* this);
  void (__fastcall* RemoveFromPlayer)(struct MultiMapFixed* this);  /* 0x8e0 */
  uint32_t (__fastcall* DoResourceAdding)(struct MultiMapFixed* this, const void* edx, enum RESOURCE_TYPE type, struct GInterfaceStatus* iface, bool param_3, struct MapCoords* param_4, int param_5);
  uint32_t (__fastcall* DoResourceRemoving)(struct MultiMapFixed* this, const void* edx, enum RESOURCE_TYPE type, uint32_t param_2, struct GInterfaceStatus* iface, bool param_4);
  int (__fastcall* CalulateAmountOverMaximum)(struct MultiMapFixed* this, const void* edx, enum RESOURCE_TYPE type);
  void (__fastcall* SetTown)(struct MultiMapFixed* this, const void* edx, struct Town* town);  /* 0x8f0 */
  void (__fastcall* RemovePotFromStructure)(struct MultiMapFixed* this, const void* edx, struct PotStructure* structure);
  bool (__fastcall* GetShouldNotBeAddedToPlanned)(struct MultiMapFixed* this);
  void (__fastcall* SetShouldNotBeAddedToPlanned)(struct MultiMapFixed* this, const void* edx, bool value);
  void (__fastcall* BuildBy)(struct MultiMapFixed* this, const void* edx, float param_1);  /* 0x900 */
  struct PlannedMultiMapFixed* (__fastcall* ConvertToPlanned)(struct MultiMapFixed* this);
  void (__fastcall* CreateCollideData)(struct MultiMapFixed* this);
};
static_assert(sizeof(struct MultiMapFixedVftable) == 0x90c, "Data type is of wrong size");

union MultiMapFixedBase
{
  struct Fixed super;
  struct Object super_object;
  struct GameThingWithPos super_gamethingwithpos;
  struct ObjectVftable* object_vftable;
  struct MultiMapFixedVftable* multiMapFixed_vftable;
  struct GameThingVftable* gameThing_vftable;
  struct GameThingWithPosVftable* gameThingWithPos_vftable;
};
static_assert(sizeof(union MultiMapFixedBase) == 0x58, "Data type is of wrong size");

struct MultiMapFixed
{
  union MultiMapFixedBase base;  /* 0x0 */
  uint8_t field_0x58;
  float percent_built;
  uint32_t field_0x60;
  struct GFootpathLink* footpath_link;
  struct MultiChildList multi_children_array;
  struct BuildingSite* building_site;  /* 0x74 */
  struct NewCollide* collide_data;
};
static_assert(sizeof(struct MultiMapFixed) == 0x7c, "Data type is of wrong size");

// Object Oriented datastructures

// win1.41 009c7f80 mac inlined MultiMapFixed::`RTTI Type Descriptor'
extern struct RTTITypeDescriptor __RTTITypeDescriptor__13MultiMapFixed asm("??_R0?AVMultiMapFixed@@@8");
// win1.41 009a6420 mac inlined MultiMapFixed::`RTTI Base Class Descriptor'
extern const struct RTTIBaseClassDescriptor __RTTIBaseClassDescriptor__13MultiMapFixed asm("??_R1A@?0A@A@MultiMapFixed@@8");
// win1.41 009ac438 mac inlined MultiMapFixed::`RTTI Base Class Array'
extern const struct RTTIBaseClassArray __RTTIBaseClassArray__13MultiMapFixed asm("??_R2MultiMapFixed@@8");
// win1.41 009ac458 mac inlined MultiMapFixed::`RTTI Class Hierarchy Descriptor'
extern const struct RTTIClassHierarchyDescriptor __RTTIClassHierarchyDescriptor__13MultiMapFixed asm("??_R3MultiMapFixed@@8");
// win1.41 008dbf80 mac 107339b0 MultiMapFixed::`RTTI Complete Object Locator'
