#ifndef BW1_DECOMP_LIVING_INCLUDED_H
#define BW1_DECOMP_LIVING_INCLUDED_H

#include <assert.h> /* For static_assert */
#include <stdint.h> /* For int32_t, uint16_t, uint32_t, uint8_t */

#include <chlasm/AllMeshes.h>                       /* For enum ANIM_LIST */
#include <chlasm/Enum.h>                            /* For enum IMMERSION_EFFECT_TYPE, enum REACTION */
#include <chlasm/GStates.h>                         /* For enum VILLAGER_STATES */
#include <Lionhead/LH3DLib/development/LH3DColor.h> /* For struct LH3DColor */
#include <re_common.h>                              /* For bool32_t */

#include "GameThing.h"        /* For struct GameThing */
#include "GameThingWithPos.h" /* For struct GameThingWithPos */
#include "LivingAction.h"     /* For enum LIVING_ACTION_INDEX, struct LivingAction */
#include "MobileWallHug.h"    /* For struct MobileWallHug, struct MobileWallHugVftable */
#include "Object.h"           /* For struct Object */

// Forward Declares

class Base;
class Creature;
class DanceGroup;
class DataPath;
class Flock;
class GFootpath;
class GFootpathNode;
class GInterfaceStatus;
class GLivingInfo;
class GameOSFile;
struct GameThingVftable;
struct GestureSystemPacketData;
struct JustMapXZ;
struct LHPoint;
struct MapCoords;
struct ObjectVftable;
class PhysicsObject;
class Reaction;
struct ReactionDoneWhen;

struct LivingMapCell
{
	uint8_t field_0x0;

	// Constructors

	// BW1W120 00767fe0 BW1M100 10595660 LivingMapCell::LivingMapCell(JustMapXZ &)
	LivingMapCell(JustMapXZ* param_1);

	// Non-virtual methods

	// BW1W120 007680d0 BW1M100 105953b0 LivingMapCell::FindFreePosition(JustMapXZ &, MapCoords const &, MapCoords *)
	bool32_t FindFreePosition(JustMapXZ* param_1, const MapCoords* param_2, MapCoords* param_3);
};

class DataForScriptRemind : public GameThing
{
public:
	uint32_t field_0x14;
	uint32_t field_0x18;
	uint32_t field_0x1c;
	uint32_t field_0x20;
	uint32_t field_0x24;
	uint32_t field_0x28;
	uint32_t field_0x2c;
	uint32_t field_0x30;
	uint32_t field_0x34;
	uint32_t field_0x38;
	uint32_t field_0x3c;
	uint32_t field_0x40;
	uint32_t field_0x44;

	// Override methods

	// BW1W120 005ef170 BW1M100 1037c460 DataForScriptRemind::_dt(void)
	virtual ~DataForScriptRemind();
	// BW1W120 005ef160 BW1M100 1037c530 DataForScriptRemind::GetDebugText(void)
	virtual char* GetDebugText();
	// BW1W120 005ef570 BW1M100 1037c5c0 DataForScriptRemind::Load(GameOSFile &)
	virtual uint32_t Load(GameOSFile& file);
	// BW1W120 005ef360 BW1M100 1037c8b0 DataForScriptRemind::Save(GameOSFile &)
	virtual uint32_t Save(GameOSFile& file);
	// BW1W120 005ef150 BW1M100 1037c4f0 DataForScriptRemind::GetSaveType(void)
	virtual uint32_t GetSaveType();

	// Static methods

	// BW1W120 005ef190 BW1M100 1037cff0 DataForScriptRemind::Create(void)
	static DataForScriptRemind* Create();

	// Constructors

	// BW1W120 005ef110 BW1M100 1037d100 DataForScriptRemind::DataForScriptRemind(void)
	DataForScriptRemind();
};

class Living : public MobileWallHug
{
public:
	struct StateTableSubEntry
	{
		bool (Living::*function)(); /* 0x0 */
		uint32_t field_0x4;
		uint32_t field_0x8;
		int32_t  field_0xc;
	};

	struct StateTableSubEntryState
	{
		uint32_t (Living::*function)(); /* 0x0 */
		uint32_t field_0x4;
		uint32_t field_0x8;
		int32_t  field_0xc;
	};

	struct StateTableSubEntryEntryState
	{
		bool (Living::*function)(VILLAGER_STATES param_1, VILLAGER_STATES param_2); /* 0x0 */
		uint32_t field_0x4;
		uint32_t field_0x8;
		int32_t  field_0xc;
	};

	struct StateTableEntry
	{
		StateTableSubEntryState      state;       /* 0x0 */
		StateTableSubEntryEntryState entry_state; /* 0x10 */
		StateTableSubEntry           exit_state;  /* 0x20 */
		StateTableSubEntry           save_state;  /* 0x30 */
		StateTableSubEntry           load_state;  /* 0x40 */
		StateTableSubEntry           field_0x50;
		StateTableSubEntry           field_0x60;
		StateTableSubEntry           transition_animation; /* 0x70 */
		StateTableSubEntry           validate;             /* 0x80 */
	};

	LivingAction         action;   /* 0x8c */
	Reaction*            reaction; /* 0x94 */
	ReactionDoneWhen*    reaction_done_when;
	int                  field_0x9c;
	int32_t              birth_turn; /* 0xa0 */
	Living*              next;
	uint32_t             field_0xa8;
	DataPath*            data_path;
	DataForScriptRemind* data_for_script_remind; /* 0xb0 */
	uint16_t             status;
	Flock*               flock;
	GameThingWithPos*    field_0xbc;
	uint32_t             field_0xc0;
	uint32_t             field_0xc4;
	GFootpath*           footpath;
	GFootpathNode*       footpath_node;
	LH3DColor            specular_color; /* 0xd0 */
	uint32_t             field_0xd4;
	DanceGroup*          dance_group;
	uint8_t              field_0xdc;

	// Override methods

	// BW1W120 004749f0 BW1M100 1016c750 Living::_dt(void)
	virtual ~Living();
	// BW1W120 005ec0a0 BW1M100 10383210 Living::ToBeDeleted(int)
	virtual void ToBeDeleted(int param_1);
	// BW1W120 004172d0 BW1M100 10006820 Living::IsFunctional(void)
	virtual bool IsFunctional();
	// BW1W120 005ee960 BW1M100 1037d8d0 Living::Load(GameOSFile &)
	virtual uint32_t Load(GameOSFile& file);
	// BW1W120 005ee630 BW1M100 1037ddd0 Living::Save(GameOSFile &)
	virtual uint32_t Save(GameOSFile& file);
	// BW1W120 005eed20 BW1M100 1037d880 Living::ResolveLoad(void)
	virtual void ResolveLoad();
	// BW1W120 004173c0 BW1M100 10130ac0 Living::IsAnimate(void)
	virtual bool IsAnimate();
	// BW1W120 004172c0 BW1M100 101306c0 Living::IsStompable(void)
	virtual bool IsStompable();
